---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartLayerFunction
source: html/245f4c3b-7730-56e2-c786-e10adca560c3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartLayerFunction Property

"Layer Function"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartLayerFunction { get; }
```